ITHACA-FV/tutorials/CFD/22datadriven_corrections/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -1 0 0 0 0];



internalField uniform 0.00235477387;

boundaryField
{
     inlet
     {
           type fixedValue;
           value $internalField;

               }
      sides
      {
           type zeroGradient;
       }
      down
    {
        type            empty;
    }
    up
    {
        type            empty;
    }

      outlet
      {
           type            calculated;
        value           $internalField;       
      }
      cylinder1     
 {
            type nutkWallFunction;
            value uniform 0;
       }
     
}


// ************************************************************************* //
